In [1]:
#MISSING VALUES !

Life Cycle of Data Science Projects --
Data COllection --- 
Feature Engineering -- Handling Missing Values

Why are their missing values ?
Survery -- Depression 
There might be some information not filled by people.
DataSet should be collected from multiple resources

Data that will be missing:
1. Continuous Data
2. categorical data

****What are types of missing Data****

MISSING COMPLETELY AT RANDOM (MCAR)
Missing Completely at Random, MCAR: A variable is missing completely at random (MCAR) if the probability of being missing is the same for all the observations. When data is MCAR, there is absolutely no relationship between the data missing and any other values, observed or missing, within the dataset. In other words, those missing data points are a random subset of the data. There is nothing systematic going on that makes some data more likely to be missing than other.

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('train.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
#AGE IS HAVING 177 missing records....

In [8]:
df[df['Embarked'].isnull()] #SEEING THE ROWS WHICH ACTUALLY HAVE NULL VALUES (EMBARKED)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [9]:
# 2. Missing Data Not At Random (MNAR) : Systematic missing values
#  There is absolutely some relationship between data missing and any other values , observed or missing , within the dataset.

In [11]:
import numpy as np
df['cabin_null']=np.where(df['Cabin'].isnull(),1,0)

#Find percentage of null values.
df['cabin_null'].mean()

0.7710437710437711

In [12]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_null
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [13]:
df.groupby(['Survived'])['cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: cabin_null, dtype: float64

In [14]:
#MISSING AT RANDOM (MAR)

In [16]:
# #All techniques of handling Missing Values...
# 1 . Mean/Median/Mode Replacement
# 2.Random Sample Imputation
# 3. Capturing Nan Values with a new feature
# 4. End of Distribution imputation
# 5. Arbitrary Imputation
# 6. Frequent Categories Imputation

In [17]:
#MEAN MEDIAN MODE IMPUTATION

In [18]:
# When should we apply ?
# Mean/Median/Mode have an assumption that data are missing completely at random.(MCAR)

In [20]:
df=pd.read_csv('train.csv',usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [21]:
##LEts go and see the percentage of missing values..
df.isnull().mean()

Survived    0.000000
Age         0.198653
Fare        0.000000
dtype: float64

In [25]:
def impute_nan(df,variable,median):
    df[variable+"_median"]=df[variable].fillna(median)

In [26]:
median=df.Age.median()
median

28.0

In [27]:
impute_nan(df,'Age',median)

In [28]:
df.head()

   Survived   Age     Fare  Age_median
0         0  22.0   7.2500        22.0
1         1  38.0  71.2833        38.0
2         1  26.0   7.9250        26.0
3         1  35.0  53.1000        35.0
4         0  35.0   8.0500        35.0